Conf.Simple/src/InformationRegisters/SUI_ВладельцыНастроекДокументов/SUI_ВладельцыНастроекДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ВладельцыНастроекДокументов</name>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументовОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ВладельцыНастроекДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьМобильныеУстройстваПоНастройке(НастройкаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МобильноеУстройство
		|ИЗ
		|	РегистрСведений.SUI_ВладельцыНастроекДокументов
		|ГДЕ
		|	НастройкаДокумента = &НастройкаДокумента";
	
	Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МобильноеУстройство");
	
КонецФункции

#КонецОбласти

#КонецЕсли
